## **Experiment 9**

#### **Name : Smayan Kulkarni, SAP ID : 60009230142 , Roll Number : D100, Division : D2-2**

In [2]:
import pandas as pd
import numpy as np



1. Create a Pandas Series from a list of 10 random integers and calculate its mean.

In [3]:
random_integers = np.random.randint(1, 100, 10)
series = pd.Series(random_integers)
mean_value = series.mean()
print("Mean:", mean_value)

Mean: 36.9

2. Create a DataFrame from a dictionary with columns 'Name', 'Age', and 'City'.

In [4]:
data = {
    'Name': ['Smayan', 'Sian', 'Varun'],
    'Age': [24, 36, 22],
    'City': ['New York', 'Mumbai', 'Chicago']
}
df = pd.DataFrame(data)
df

     Name  Age      City
0  Smayan   24  New York
1    Sian   36    Mumbai
2   Varun   22   Chicago

3. Access the first 5 elements of a Pandas Series using slicing.

In [5]:
first_five = series[:5]
print(first_five)

0    15
1    57
2    80
3    24
4    23
dtype: int32

4. Add a new column 'Score' to a DataFrame with values [85, 90, 78, 92].

In [6]:
df['Score'] = [85, 90, 78]  
df

     Name  Age      City  Score
0  Smayan   24  New York     85
1    Sian   36    Mumbai     90
2   Varun   22   Chicago     78

5. Use .iloc to access the first row of a DataFrame.

In [7]:
first_row = df.iloc[0]
print(first_row)

Name       Smayan
Age            24
City     New York
Score          85
Name: 0, dtype: object

6. Use .loc to select the rows where 'Age' is 25 in a DataFrame.

In [8]:
age_25 = df.loc[df['Age'] == 25]

(age_25)

Empty DataFrame
Columns: [Name, Age, City, Score]
Index: []

7. Create a Series with a custom index ['a', 'b', 'c'] and access the value at index 'b'.

In [9]:
cust_series = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
value_b = cust_series['b']
print(value_b)

20


8. Calculate the standard deviation of a Series containing numerical values.

In [10]:
std_dev = np.std(series)
print("Standard Deviation:", std_dev)

Standard Deviation: 26.36076630145641

9. Create a DataFrame and drop the 'City' column using the drop method.

In [11]:
df_dropped = df.drop('City', axis=1)
df_dropped

     Name  Age  Score
0  Smayan   24     85
1    Sian   36     90
2   Varun   22     78

10. Filter a DataFrame to show rows where 'Age' is greater than 30 using boolean indexing.

In [12]:
age_greater_30 = df[df['Age'] > 30]
print(age_greater_30)

   Name  Age    City  Score
1  Sian   36  Mumbai     90

11. Apply a lambda function to a DataFrame column to square the values.

In [13]:
df['Score'] = df['Score'].apply(lambda x: x**2)
df

     Name  Age      City  Score
0  Smayan   24  New York   7225
1    Sian   36    Mumbai   8100
2   Varun   22   Chicago   6084


12. Use .iloc to select the last 3 rows of a DataFrame.

In [14]:
last_three_rows = df.iloc[-3:]
print(last_three_rows)

     Name  Age      City  Score
0  Smayan   24  New York   7225
1    Sian   36    Mumbai   8100
2   Varun   22   Chicago   6084

13. Rename the 'Name' column to 'FullName' in a DataFrame and display the DataFrame.

In [15]:
df.rename(columns={'Name': 'FullName'}, inplace=True)
print(df)

  FullName  Age      City  Score
0   Smayan   24  New York   7225
1     Sian   36    Mumbai   8100
2    Varun   22   Chicago   6084


14. Use .loc to select rows based on a condition and specific columns.

In [16]:
specific_columns = df.loc[df['Age'] > 25, ['FullName', 'Age']]
print(specific_columns)

  FullName  Age
1     Sian   36

15. Create a DataFrame from a list of lists with columns ['A', 'B', 'C'] and calculate the mean of each column.

In [17]:
list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df_lists = pd.DataFrame(list_of_lists, columns=['A', 'B', 'C'])
means = df_lists.mean()
print(means)

A    4.0
B    5.0
C    6.0
dtype: float64

16. Load the Titanic dataset from kaggle into a DataFrame and display the first 5 rows.

In [18]:
titanic_df = pd.read_csv("train.csv")
titanic_df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

17. Calculate the correlation matrix of a DataFrame with numerical columns from the Wine Quality dataset .

In [19]:
wine_df = pd.read_csv('winequality-red.csv')
corrmatrix = wine_df.corr()
corrmatrix

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
fixed acidity,1.000000,-0.256131,0.671703,0.114777,0.093705,-0.153794,-0.113181,0.668047,-0.682978,0.183006,-0.061668,0.124052
volatile acidity,-0.256131,1.000000,-0.552496,0.001918,0.061298,-0.010504,0.076470,0.022026,0.234937,-0.260987,-0.202288,-0.390558
citric acid,0.671703,-0.552496,1.000000,0.143577,0.203823,-0.060978,0.035533,0.364947,-0.541904,0.312770,0.109903,0.226373
residual sugar,0.114777,0.001918,0.143577,1.000000,0.055610,0.187049,0.203028,0.355283,-0.085652,0.005527,0.042075,0.013732
chlorides,0.093705,0.061298,0.203823,0.055610,1.000000,0.005562,0.047400,0.200632,-0.265026,0.371260,-0.221141,-0.128907
free sulfur dioxide,-0.153794,-0.010504,-0.060978,0.187049,0.005562,1.000000,0.667666,-0.021946,0.070377,0.051658,-0.069408,-0.050656
total sulfur dioxide,-0.113181,0.076470,0.035533,0.203028,0.047400,0.667666,1.000000,0.071269,-0.066495,0.042947,-0.205654,-0.185100
density,0.668047,0.022026,0.364947,0.355283,0.200632,-0.021946,0.071269,1.000000,-0.341699,0.148506,-0.496180,-0.174919
pH,-0.682978,0.234937,-0.541904,-0.085652,-0.265026,0.070377,-0.066495,-0.341699,1.000000,-0.196648,0.205633,-0.057731
sulphates,0.183006,-0.260987,0.312770,0.005527,0.371260,0.051658,0.042947,0.148506,-0.196648,1.000000,0.093595,0.251397
alcohol,-0.061668,-0.202288,0.109903,0.042075,-0.221141,-0.069408,-0.205654,-0.496180,0.205633,0.093595,1.000000,0.476166
quality,0.124052,-0.390558,0.226373,0.013732,-0.128907,-0.050656,-0.185100,-0.174919,-0.057731,0.251397,0.476166,1.000000

18. Create a DataFrame with a 'Date' column and set it as the index, then resample the data by month.

In [20]:
date_rng = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')

df_date = pd.DataFrame(date_rng, columns=['Date'])
df_date['Value'] = np.random.randint(0, 100, size=(len(date_rng)))

df_date.set_index('Date', inplace=True)

monthly_resampled = df_date.resample('M').sum()

print(monthly_resampled)

            Value
Date
2023-01-31   1658
2023-02-28   1478
2023-03-31   1455
2023-04-30   1473
2023-05-31   1738
2023-06-30   1550
2023-07-31   1429
2023-08-31   1696
2023-09-30   1532
2023-10-31   1602
2023-11-30   1514
2023-12-31   1567

C:\Users\djsce.student\AppData\Local\Temp\ipykernel_14784\771239444.py:8: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_resampled = df_date.resample('M').sum()